Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/error-boundaries_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: error-boundaries title: Error Boundaries permalink: docs/error-boundaries.html ---
ja: --- id: error-boundaries title: Error Boundary permalink: docs/error-boundaries.html ---

source: In the past, JavaScript errors inside components used to corrupt React’s internal state and cause it to [emit](https://github.com/facebook/react/issues/4026) [cryptic](https://github.com/facebook/react/issues/6895) [errors](https://github.com/facebook/react/issues/8579) on next renders.
ja: かつて、コンポーネント内で発生した JavaScript エラーは React の内部状態を破壊し、以降のレンダーで[不可解な](https://github.com/facebook/react/issues/4026) [エラーを](https://github.com/facebook/react/issues/6895) [引き起こして](https://github.com/facebook/react/issues/8579)いました。

source: These errors were always caused by an earlier error in the application code, but React did not provide a way to handle them gracefully in components, and could not recover from them.
ja: このようなエラーはアプリケーションコード中のどこか前の段階で発生したエラーによって引き起こされますが、React はエラーをコンポーネント内で適切に処理する方法を提供していなかったため回復できませんでした。

source: ## Introducing Error Boundaries {#introducing-error-boundaries}
ja: ## error boundary とは {#introducing-error-boundaries}

source: A JavaScript error in a part of the UI shouldn’t break the whole app.
ja: UI の一部に JavaScript エラーがあってもアプリ全体が壊れてはいけません。

source: To solve this problem for React users, React 16 introduces a new concept of an “error boundary”.
ja: React ユーザがこの問題に対応できるように、React 16 では “error boundary” という新しい概念を導入しました。

source: Error boundaries are React components that **catch JavaScript errors anywhere in their child component tree, log those errors, and display a fallback UI** instead of the component tree that crashed.
ja: error boundary は**自身の子コンポーネントツリーで発生した JavaScript エラーをキャッチ**し、**エラーを記録**し、クラッシュしたコンポーネントツリーの代わりに**フォールバック用の UI を表示**する React コンポーネントです。

source: Error boundaries catch errors during rendering, in lifecycle methods, and in constructors of the whole tree below them.
ja: error boundary は配下のツリー全体のレンダー中、ライフサイクルメソッド内、およびコンストラクタ内で発生したエラーをキャッチします。

source: > Note > > Error boundaries do **not** catch errors for: > > * Event handlers ([learn more](#how-about-event-handlers)) > * Asynchronous code (e.g. `setTimeout` or `requestAnimationFrame` callbacks) > * Server side rendering > * Errors thrown in the error boundary itself (rather than its children)
ja: > 補足 > > error boundary は以下のエラーをキャッチ**しません**： > > * イベントハンドラ（[詳細](#how-about-event-handlers)） > * 非同期コード（例：`setTimeout` や `requestAnimationFrame` のコールバック） > * サーバサイドレンダリング > * （子コンポーネントではなく）error boundary 自身がスローしたエラー

source: A class component becomes an error boundary if it defines either (or both) of the lifecycle methods [`static getDerivedStateFromError()`](/docs/react-component.html#static-getderivedstatefromerror) or [`componentDidCatch()`](/docs/react-component.html#componentdidcatch).
ja: クラスコンポーネントに、ライフサイクルメソッドの [`static getDerivedStateFromError()`](/docs/react-component.html#static-getderivedstatefromerror) か [`componentDidCatch()`](/docs/react-component.html#componentdidcatch) のいずれか（または両方）を定義すると、error boundary になります。

source: Use `static getDerivedStateFromError()` to render a fallback UI after an error has been thrown.
ja: `static getDerivedStateFromError()` はエラーがスローされた後にフォールバック UI をレンダーするために使用します。

source: Use `componentDidCatch()` to log error information.
ja: `componentDidCatch()` はエラー情報をログに記録するために使用します。

source: Then you can use it as a regular component:
ja: 使用する際は通常のコンポーネントとして扱います：

source: Error boundaries work like a JavaScript `catch {}` block, but for components.
ja: error boundary はコンポーネントに対して JavaScript の `catch {}` ブロックのように動作します。

source: Only class components can be error boundaries.
ja: error boundary になれるのはクラスコンポーネントだけです。

source: In practice, most of the time you’ll want to declare an error boundary component once and use it throughout your application.
ja: 実用上、一度だけ error boundary を定義してそれをアプリケーションの至るところで使用することがよくあります。

source: Note that **error boundaries only catch errors in the components below them in the tree**.
ja: **error boundary は配下のツリー内のコンポーネントで発生したエラーのみをキャッチする**ことに注意してください。

source: An error boundary can’t catch an error within itself.
ja: error boundary は自身で起こるエラーをキャッチできません。

source: If an error boundary fails trying to render the error message, the error will propagate to the closest error boundary above it.
ja: error boundary がエラーメッセージのレンダーに失敗した場合、そのエラーは最も近い上位の error boundary に伝搬します。

source: This, too, is similar to how catch {} block works in JavaScript.
ja: この動作もまた、JavaScript の catch {} ブロックの動作と似ています。

source: ## Live Demo {#live-demo}
ja: ## ライブデモ {#live-demo}

source: Check out [this example of declaring and using an error boundary](https://codepen.io/gaearon/pen/wqvxGa?editors=0010) with [React 16](/blog/2017/09/26/react-v16.0.html).
ja: [React 16](/blog/2017/09/26/react-v16.0.html) で [error boundary を宣言して利用する例](https://codepen.io/gaearon/pen/wqvxGa?editors=0010)を確認してください。

source: ## Where to Place Error Boundaries {#where-to-place-error-boundaries}
ja: ## error boundary を配置すべき場所 {#where-to-place-error-boundaries}

source: The granularity of error boundaries is up to you.
ja: error boundary の粒度はあなた次第です。

source: You may wrap top-level route components to display a “Something went wrong” message to the user, just like how server-side frameworks often handle crashes.
ja: サーバサイドフレームワークがクラッシュを処理する際によく見られるように、最上位のルートコンポーネントをラップしてユーザに “Something went wrong” メッセージを表示してもいいでしょう。

source: You may also wrap individual widgets in an error boundary to protect them from crashing the rest of the application.
ja: 各ウィジェットを個別にラップしてアプリケーションの残りの部分をクラッシュから守るのもいいでしょう。

source: ## New Behavior for Uncaught Errors {#new-behavior-for-uncaught-errors}
ja: ## エラーがキャッチされなかった場合の新しい動作 {#new-behavior-for-uncaught-errors}

source: This change has an important implication.
ja: この変更には重要な意味があります。

source: **As of React 16, errors that were not caught by any error boundary will result in unmounting of the whole React component tree.**
ja: **React 16 から、どの error boundary でもエラーがキャッチされなかった場合に React コンポーネントツリー全体がアンマウントされるようになりました。**

source: We debated this decision, but in our experience it is worse to leave corrupted UI in place than to completely remove it.
ja: この決定については議論がありましたが、我々の経験上、壊れた UI をそのまま表示しておくことは、完全に削除してしまうよりももっと悪いことです。

source: For example, in a product like Messenger leaving the broken UI visible could lead to somebody sending a message to the wrong person.
ja: 例えば、Messenger のような製品において壊れた UI を表示したままにしておくと、誰かが誤って別の人にメッセージを送ってしまう可能性があります。

source: Similarly, it is worse for a payments app to display a wrong amount than to render nothing.
ja: 同様に、支払いアプリで間違った金額を表示することは、何も表示しないよりも悪いことです。

source: This change means that as you migrate to React 16, you will likely uncover existing crashes in your application that have been unnoticed before.
ja: この変更のため、React 16 に移行すると、これまで気付かれていなかったアプリケーションの既存の不具合が明らかになることでしょう。

source: Adding error boundaries lets you provide better user experience when something goes wrong.
ja: error boundary を追加することで、問題が発生したときのユーザ体験を向上できます。

source: For example, Facebook Messenger wraps content of the sidebar, the info panel, the conversation log, and the message input into separate error boundaries.
ja: 例えば、Facebook Messenger はサイドバー、情報パネル、会話ログ、メッセージ入力欄といったコンテンツを個別の error boundary でラップしています。

source: If some component in one of these UI areas crashes, the rest of them remain interactive.
ja: これらの UI エリアの一部のコンポーネントがクラッシュしても、残りの部分はインタラクティブなままです。

source: We also encourage you to use JS error reporting services (or build your own) so that you can learn about unhandled exceptions as they happen in production, and fix them.
ja: また、本番環境で発生したキャッチされなかった例外について知って修正できるように、JS エラー報告サービスを利用（もしくは自身で構築）することもお勧めします。

source: ## Component Stack Traces {#component-stack-traces}
ja: ## コンポーネントのスタックトレース {#component-stack-traces}

source: React 16 prints all errors that occurred during rendering to the console in development, even if the application accidentally swallows them.
ja: React 16 は開発時に、レンダー中に起こった全てのエラーをコンソールに出力します（アプリケーションが誤ってエラーを握り潰してしまっても出力します）。

source: In addition to the error message and the JavaScript stack, it also provides component stack traces.
ja: そこではエラーメッセージと JavaScript のスタックに加えて、コンポーネントのスタックトレースも提供します。

source: Now you can see where exactly in the component tree the failure has happened:
ja: これにより、コンポーネントツリーのどこでエラーが発生したのかが正確にわかります：

source: You can also see the filenames and line numbers in the component stack trace.
ja: コンポーネントスタックトレースにはファイル名と行番号も出力できます。

source: This works by default in [Create React App](https://github.com/facebookincubator/create-react-app) projects:
ja: [Create React App](https://github.com/facebookincubator/create-react-app) のプロジェクトではこれがデフォルトで有効になっています：

source: If you don’t use Create React App, you can add [this plugin](https://www.npmjs.com/package/@babel/plugin-transform-react-jsx-source) manually to your Babel configuration.
ja: Create React App を使用しない場合は、[このプラグイン](https://www.npmjs.com/package/@babel/plugin-transform-react-jsx-source)を手動で Babel の設定に追加してください。

source: Note that it’s intended only for development and **must be disabled in production**.
ja: ただし、この機能は開発専用であり、**本番では必ず無効化しなければならない**ことに注意してください。

source: > Note > > Component names displayed in the stack traces depend on the [`Function.name`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/name) property.
ja: > 補足 > > スタックトレースで表示されるコンポーネント名は [`Function.name`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Function/name) プロパティに依存します。

source: If you support older browsers and devices which may not yet provide this natively (e.g. IE 11), consider including a `Function.name` polyfill in your bundled application, such as [`function.name-polyfill`](https://github.com/JamesMGreene/Function.name).
ja: このプロパティをネイティブで提供しない古いブラウザやデバイス（IE 11 など）をサポートする場合は、アプリケーションバンドルに `Function.name` のポリフィル（[`function.name-polyfill`](https://github.com/JamesMGreene/Function.name) など）を含めることを検討してください。

source: Alternatively, you may explicitly set the [`displayName`](/docs/react-component.html#displayname) property on all your components.
ja: もしくは、全てのコンポーネントに [`displayName`](/docs/react-component.html#displayname) プロパティを明示的に設定することもできます。

source: ## How About try/catch? {#how-about-trycatch}
ja: ## try/catch について {#how-about-trycatch}

source: `try` / `catch` is great but it only works for imperative code:
ja: `try` / `catch` は素晴らしいですが、命令型のコードでのみ動作します：

source: However, React components are declarative and specify *what* should be rendered:
ja: 一方、React コンポーネントは宣言型であり、*何が*レンダーされるべきなのかを指定します：

source: Error boundaries preserve the declarative nature of React, and behave as you would expect.
ja: error boundary は React の宣言型という性質を保持しつつ、期待通りの動作をします。

source: For example, even if an error occurs in a `componentDidUpdate` method caused by a `setState` somewhere deep in the tree, it will still correctly propagate to the closest error boundary.
ja: 例えば、`componentDidUpdate` メソッドで発生したエラーがツリー内のどこか深い場所にある `setState` によって引き起こされていた場合でも、最も近い error boundary にそのことが正しく伝播します。

source: ## How About Event Handlers? {#how-about-event-handlers}
ja: ## イベントハンドラについて {#how-about-event-handlers}

source: Error boundaries **do not** catch errors inside event handlers.
ja: error boundary はイベントハンドラ内で発生したエラーをキャッチ**しません**。

source: React doesn't need error boundaries to recover from errors in event handlers.
ja: イベントハンドラ内のエラーから回復するのに error boundary は不要です。

source: Unlike the render method and lifecycle methods, the event handlers don't happen during rendering.
ja: レンダーメソッドやライフサイクルメソッドとは異なり、イベントハンドラはレンダー中には実行されません。

source: So if they throw, React still knows what to display on the screen.
ja: そのためイベントハンドラ内でエラーが発生しても、React が画面に表示する内容は変わりません。

source: If you need to catch an error inside an event handler, use the regular JavaScript `try` / `catch` statement:
ja: イベントハンドラ内のエラーをキャッチする必要がある場合は、普通の JavaScript の `try` / `catch` 文を使用してください：

source: Note that the above example is demonstrating regular JavaScript behavior and doesn't use error boundaries.
ja: 上記の例は標準の JavaScript の動作説明であって error boundary を使用していないことに注意してください。

source: ## Naming Changes from React 15 {#naming-changes-from-react-15}
ja: ## React 15 からの命名の変更 {#naming-changes-from-react-15}

source: React 15 included a very limited support for error boundaries under a different method name: `unstable_handleError`.
ja: React 15 は error boundary を異なるメソッド名（`unstable_handleError`）で非常に限定的にサポートしていました。

source: This method no longer works, and you will need to change it to `componentDidCatch` in your code starting from the first 16 beta release.
ja: このメソッドはもう動作しないため、16 ベータ版リリース以降はコードを `componentDidCatch` に変更する必要があります。

source: For this change, we’ve provided a [codemod](https://github.com/reactjs/react-codemod#error-boundaries) to automatically migrate your code.
ja: この変更について、自動的にコードを移行できる [codemod](https://github.com/reactjs/react-codemod#error-boundaries) が提供されています。
